app/controllers/api/trends/latest_episodes_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2, $3, $4)  [["id", 17], ["id", 21], ["id", 16], ["id", 15]]
SELECT "podcasts".* FROM "podcasts" WHERE "podcasts"."id" IN ($1, $2, $3, $4)  [["id", 38], ["id", 52], ["id", 77], ["id", 1]]
---
  def index
    @episodes = Episode.ordered.limit(4).includes(:podcast, :category)