app/controllers/api/trends/podcasts_to_try_controller.rb

SELECT "podcasts".* FROM "podcasts" ORDER BY random() LIMIT $1  [["LIMIT", 4]]
---
  def index
    @podcasts_to_try = Podcast.order('random()').limit(4)