app/controllers/api/backgrounds_controller.rb

SELECT "backgrounds".* FROM "backgrounds" WHERE "backgrounds"."location" = $1 LIMIT $2  [["location", 0], ["LIMIT", 1]]
---
  def show
    @background = Background.find_by(location: Background.locations[params[:id].to_sym])