app/controllers/api/categories_controller.rb

  def index
    @categories = Category.ordered
---
SELECT MAX("categories"."updated_at") FROM "categories"