app/views/partials/_footer.html.haml

%ul.lighter-links
  - Footer.order(:position).each do |item|
---
SELECT "footers".* FROM "footers" ORDER BY "footers"."position" ASC